Revit 2027 API
RibbonPanel.GetItems Method
Gets a copy of the collection of RibbonItems assigned to the RibbonPanel.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<RibbonItem> GetItems()
Public Function GetItems As IList(Of RibbonItem)
public:
IList<RibbonItem^>^ GetItems()
member GetItems : unit -> IList<RibbonItem>
Return Value
IList<RibbonItem>
Remarks
This method gets the items assigned to the RibbonPanel.
See Also
Reference
RibbonPanel Class
Autodesk.Revit.UI Namespace